tutorials-OpenFOAM-dev/multiRegionReactingFoam/multiRegionReactingFoamTutorial/constant/bottomAir/reactions
species
(
    O2
    N2
);

reactions
{
}
